app/Controllers/CustomerDash.php

SELECT *
FROM `categories`
SELECT `product`.*, `categories`.`categories` as `category_name`
FROM `product`
JOIN `categories` ON `product`.`categories_id` = `categories`.`id`
---
    public function dash()
    {
        $categorymodel = new CategoryModel();
        $categorydata = $categorymodel->findAll();

        $productmodel = new ProductModel();
        $productdata = $productmodel
          ->select('product.*, categories.categories as category_name')
          ->join('categories', 'product.categories_id = categories.id')
          ->findAll();

SELECT *
FROM `categories`
SELECT `product`.*, `categories`.`categories` as `category_name`
FROM `product`
JOIN `categories` ON `product`.`categories_id` = `categories`.`id`
WHERE `categories_id` = 'images'
SELECT *
FROM `product`
WHERE `categories_id` = '1'
ORDER BY `price` DESC
SELECT *
FROM `product`
WHERE `categories_id` = '1'
ORDER BY `id` DESC
---
    public function productbycategory($categoryId){
    $categorymodel = new CategoryModel();
    $categorydata = $categorymodel->findAll();

    $productmodel = new ProductModel();
    $productdata = $productmodel
        ->select('product.*, categories.categories as category_name')
        ->join('categories', 'product.categories_id = categories.id')
        ->where('categories_id', $categoryId) // Filter products by category
        ->findAll();

        $sortingOption = $this->request->getGet('sorting'); // Get the selected sorting option from the URL query string

        switch ($sortingOption) {
            case 'price_high':
                $productdata = $productmodel
                    ->where('categories_id', $categoryId)
                    ->orderBy('price', 'ASC')
                    ->findAll();

                break;
            case 'price_low':
                $productdata = $productmodel
                    ->where('categories_id', $categoryId)
                    ->orderBy('price', 'DESC')
                    ->findAll();
                break;
            case 'new':
                $productdata = $productmodel
                    ->where('categories_id', $categoryId)
                    ->orderBy('id', 'DESC')
                    ->findAll();

SELECT *
FROM `categories`
SELECT `product`.*, `categories`.`categories` as `category_name`
FROM `product`
JOIN `categories` ON `product`.`categories_id` = `categories`.`id`
WHERE `product`.`id` = '8'
 LIMIT 1
---
    public function productdetail($productId){
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

      $productModel = new ProductModel();
      $productdata = $productModel
          ->select('product.*, categories.categories as category_name')
          ->join('categories', 'product.categories_id = categories.id')
          ->where('product.id', $productId)
          ->first();  // Fetch a single product by its ID

SELECT *
FROM `product`
WHERE `product`.`id` = '8'
---
    public function addtocart($product_id, $selectedQuantity){
      $productmodel = new ProductModel();
      $product = $productmodel->find($product_id);

SELECT *
FROM `categories`
---
    public function cart(){
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

SELECT *
FROM `categories`
---
    public function checkout(){
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

SELECT *
FROM `categories`
SELECT *
FROM `users`
WHERE `email` = 'kunal@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $categoryModel = new CategoryModel();
        $categorydata = $categoryModel->findAll();
        $loggedIn = false;
        $cart = session()->get('cart');

        $total = 0; // Initialize the total amount

        // Calculate the total by summing up the prices of items in the cart
        foreach ($cart as $product) {
            $total += $product['price']* $product['qty'];
        }

        if ($this->request->getMethod() === 'post') {
            // Validate the user's input here (e.g., username and password).

            $usermodel = new UsersModel();
            $userdata = $usermodel->where('email', $this->request->getVar('email'))
                          ->first();

SELECT *
FROM `categories`
---
    public function info(){
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

INSERT INTO `order` (`user_id`, `address`, `city`, `pincode`, `payment_type`, `total_price`, `payment_status`, `order_status`, `added_on`) VALUES ('1', '31/1, 38, Nirgudi Road, Lohagaon', 'Pune, Maharashtra', '411047', 'COD', 100, 'success', 1, '2023-11-01 12:25:13')
---
            ];

            // Insert order data into the database
            $orderModel->insert($data);

INSERT INTO `order_detail` (`order_id`, `product_id`, `qty`, `price`, `added_on`) VALUES (2, '8', '1', '100', '2023-11-01 12:25:13')
---
                    'price' => $product['price'],
                    'added_on' => date('Y-m-d H:i:s')
                ];
                $orderdetailModel->insert($orderDetailData);

SELECT *
FROM `categories`
---
    public function thankyou(){
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

SELECT *
FROM `categories`
SELECT *
FROM `order`
WHERE `user_id` = '1'
SELECT *
FROM `order_status`
SELECT *
FROM `order_detail`
WHERE `order_id` = '1'
---
    public function order()
    {
        $categoryModel = new CategoryModel();
        $categorydata = $categoryModel->findAll();
        $user_id = session()->get('user_id');

        $orderModel = new OrderModel();
        $orderdetailModel = new OrderDetailModel();
        $orderStatusModel = new OrderStatusModel();

        // Retrieve orders for the user
        $orderHistory = $orderModel->where('user_id', $user_id)->findAll();

        // Create a mapping array for order status IDs to their corresponding names
        $orderStatusMapping = [];

        // Retrieve all order statuses from the database
        $orderStatuses = $orderStatusModel->findAll();

        // Populate the mapping array
        foreach ($orderStatuses as $status) {
            $orderStatusMapping[$status['id']] = $status['name'];
        }

        // For each order, retrieve the associated order details
        foreach ($orderHistory as &$order) {
            $order_id = $order['id']; // Assuming the 'id' field in the 'order' table is the primary key
            $order_details = $orderdetailModel->where('order_id', $order_id)->findAll();