app/Controllers/CustomerUser.php

SELECT *
FROM `categories`
SELECT *
FROM `users`
WHERE `email` = 'kunal@gmail.com'
 LIMIT 1
---
  public function login()
  {
      $categoryModel = new CategoryModel();
      $categorydata = $categoryModel->findAll();

      if ($this->request->getMethod() === 'post') {
          // Validate the user's input here (e.g., username and password).

          $usermodel = new UsersModel();
          $userdata = $usermodel->where('email', $this->request->getVar('email'))
                        ->first();